{"modelType": "ODE", "modelTopology": [], "modelDEs": [["mtROS'", "(7*AMPK^4)/(10*(AMPK^4+104976))-mtROS/10+5634282409793945/(549755813888*(AMPK^4+14641))+7203/(2*(HIF1^4+2401))"], ["noxROS'", "HIF1^4/(10*(HIF1^4+6561))-noxROS/10+2401/(10*(AMPK^4+2401))"], ["AMPK'", "6561/(10*(AMPK^4+6561))-AMPK/10+57122/(HIF1^4+28561)+(mtROS+noxROS)^4/((mtROS+noxROS)^4+130321)"], ["HIF1'", "(9*HIF1^4)/(10*(HIF1^4+160000))-HIF1/10+3336584857596723/(68719476736*(AMPK^4+28561))+375/(2*(P53^4+625))+(4*(mtROS+noxROS)^4)/(5*((mtROS+noxROS)^4+83521))"], ["ZEB1'", "(3*HIF1^4)/(5*(HIF1^4+14641))-ZEB1/10+(3*SNAIL^4)/(2*(SNAIL^4+20736))+(6*ZEB1^4)/(5*(ZEB1^4+130321))+4751869352922317/(137438953472*(MIR200^4+38416))+91125/(MIR145^4+50625)"], ["OCT4'", "(19*OCT4^4)/(10*(OCT4^4+28561))-OCT4/10+4802/(5*(MIR145^4+2401))+70875/(2*(P53^4+50625))"], ["MDM2'", "(7*P53^4)/(10*(P53^4+14641))-MDM2/10+4751869352922317/(68719476736*(MIR145^4+38416))"], ["SNAIL'", "1125/(MIR34^4+625)-SNAIL/10+4751869352922317/(68719476736*(SNAIL^4+38416))"], ["MIR145'", "(3*P53^4)/(10*(P53^4+14641))-MIR145/10+38912/(5*(OCT4^4+4096))+4278419646001971/(34359738368*(ZEB1^4+65536))"], ["MIR200'", "OCT4^4/(10*(OCT4^4+1296))-MIR200/10+(4*P53^4)/(5*(P53^4+83521))+1373887882539827/(34359738368*(SNAIL^4+28561))+48000/(ZEB1^4+160000)"], ["MIR34'", "(9*P53^4)/(5*(P53^4+1296))-MIR34/10+5000/(SNAIL^4+10000)+10125/(ZEB1^4+50625)"], ["P53'", "(2*AMPK^4)/(AMPK^4+1296)-P53/10+(9*HIF1^4)/(10*(HIF1^4+83521))+38416/(MDM2^4+38416)"]], "stablePoints": [[7.0745138185787075, 1.9404810694019237, 3.141262297071071, 23.648597973519973, 49.908548989316195, 27.917405989842297, 20.94820008383107, 11.916824603432374, 1.5906564275330897, 10.185508858818054, 17.724415250844594, 10.163907731817185], [7.0759669371462195, 1.9367771913255678, 3.2006014719900424, 23.418660074628455, 32.00940547309093, 2.5542756302752143, 8.38015829104419, 11.901648942680332, 22.50816511268065, 12.83961082238265, 19.504399897043943, 17.404361368528733], [16.495780986839243, 0.12457307200807353, 23.12872211625519, 5.420145690791635, 41.02951378906927, 22.212600437773812, 24.435015845698274, 11.90115708479145, 3.5328664667748635, 14.967131148148605, 19.578646047114646, 20.974661730595958], [16.506203577972258, 0.12424296200716939, 23.136122271074534, 5.415927556558226, 12.590876498460021, 0.4547263201017411, 7.281027047823498, 11.893430096404616, 35.67499527563363, 18.012964746167857, 20.9711614165101, 29.320008456752742]], "sigma": [[[0.04972734053259623, -0.0002014494613420296, 0.0029635906864739795, 0.006451716671754125, 0.00011857548894312481, -0.0002548020176154188, 0.00042362128167368107, -1.8266936984895567e-06, 0.00018154840656771704, 0.00019946472049676547, 0.000432862790018691, 0.0022234433819566394], [-0.00020144946134202958, 0.049895070070667714, 0.0027423535710328186, 0.007597362689666747, 0.00018801416323087063, -0.00022045619086087632, 0.00037753773433546434, -1.2029321537551799e-06, 0.00015889167874380523, 0.00017530617390741843, 0.00038271273801717613, 0.00217690799355083], [0.0029635906864739795, 0.00274235357103282, 0.053861313649878284, -0.014215800145555789, -0.0029215629848884555, -0.009245638867129917, 0.014495795207036822, -0.0001154578579832799, 0.0063530678395874235, 0.006931118353593849, 0.014842751955612972, 0.04170389873605298], [0.006451716671754123, 0.007597362689666748, -0.014215800145555787, 0.08313446140901865, 0.0035338502300255844, 0.0030661665550840212, -0.004343028375406288, 4.9552494189060756e-05, -0.002055375602955583, -0.0022220525470406567, -0.004695300809245272, -0.006005464613772152], [0.00011857548894312486, 0.00018801416323087068, -0.002921562984888457, 0.0035338502300255852, 0.08265987751562022, 0.004999204373018162, -0.006971569039482366, 0.009392648029790167, -0.00415014789420152, -0.03154513083910224, -0.011921761675727338, -0.00787330280597389], [-0.0002548020176154188, -0.0002204561908608762, -0.009245638867129915, 0.00306616655508402, 0.00499920437301816, 0.06949865347094414, -0.018043997136154028, 0.00020193557892370583, -0.009836753721021732, -0.009342365202614812, -0.019865655529765092, -0.028075800593053108], [0.0004236212816736815, 0.00037753773433546445, 0.014495795207036817, -0.004343028375406286, -0.006971569039482363, -0.018043997136154028, 0.07514171005881584, -0.0002842205851259575, 0.011872870622857416, 0.013134507600182777, 0.02792031450447354, 0.03755885938849095], [-1.8266936984895584e-06, -1.202932153755173e-06, -0.00011545785798327997, 4.955249418906077e-05, 0.009392648029790167, 0.0002019355789237059, -0.0002842205851259575, 0.021184143609377856, -0.00017744382669603718, -0.0073615040388992, -0.003038800202075968, -0.00036945624819689624], [0.00018154840656771704, 0.0001588916787438049, 0.0063530678395874235, -0.002055375602955582, -0.004150147894201519, -0.009836753721021736, 0.01187287062285742, -0.00017744382669603723, 0.0557791045885804, 0.006502493566368614, 0.013342961881416348, 0.019227087749412005], [0.00019946472049676525, 0.00017530617390741843, 0.006931118353593851, -0.002222052547040656, -0.03154513083910224, -0.009342365202614809, 0.013134507600182779, -0.007361504038899198, 0.006502493566368615, 0.0652035168202251, 0.017415462042678236, 0.02095751949452907], [0.00043286279001869126, 0.00038271273801717515, 0.014842751955612972, -0.004695300809245273, -0.011921761675727333, -0.019865655529765096, 0.027920314504473544, -0.0030388002020759674, 0.013342961881416345, 0.017415462042678236, 0.08183035294748756, 0.04485821194454864], [0.00222344338195664, 0.0021769079935508285, 0.041703898736052986, -0.00600546461377215, -0.007873302805973884, -0.028075800593053105, 0.03755885938849095, -0.0003694562481968964, 0.019227087749411998, 0.020957519494529064, 0.04485821194454865, 0.10756775525362657]], [[0.049718207299574234, -0.00020676462729719988, 0.0028427466329634136, 0.006502224191819692, 0.00018488459826145726, -0.00018459784588480832, 0.00010771395993233221, -3.583985221056709e-08, 1.8161859005543045e-05, 0.0002249314521367337, 2.695266199542964e-05, 0.0021386087722633437], [-0.00020676462729719988, 0.04989632861218798, 0.0026165459875930152, 0.007714614132712762, 0.0002586658532568327, -0.00018298007040902942, 0.00011107081222857856, -2.8678879904737357e-08, 7.955400707299293e-06, 0.00022085816576672879, 2.6060448097888376e-05, 0.002132499294916143], [0.002842746632963412, 0.0026165459875930152, 0.05376053673122557, -0.01363931923221377, -0.005374615011995109, -0.008464197154827945, 0.0036124822887633567, -6.205961745223367e-06, 0.0035299445229429243, 0.010202056339338511, 0.0013070241042489326, 0.04428826896706548], [0.006502224191819691, 0.007714614132712762, -0.013639319232213766, 0.08363720722969649, 0.003807993424192173, 0.0010867108379721377, -0.00027206714167608045, 1.1919273239449844e-06, -0.0008491143496741098, -0.0013613690992617168, -0.00018868874369380725, -0.002791977984166189], [0.00018488459826145759, 0.00025866585325683253, -0.005374615011995112, 0.0038079934241921727, 0.12996251074814072, 0.013668228809886253, 0.005542934521725525, 0.009938922546096678, -0.031181528460465704, -0.050555293096014406, -0.007678300747838685, -0.023618174504065764], [-0.00018459784588480813, -0.000182980070409029, -0.008464197154827945, 0.0010867108379721373, 0.013668228809886255, 0.06445927696872616, 2.8380766103475034e-06, 1.332210579680592e-05, -0.015559577969360232, -0.013071526652462289, -0.0018982339993614062, -0.03121731608796985], [0.0001077139599323321, 0.00011107081222857862, 0.0036124822887633576, -0.00027206714167608067, 0.005542934521725525, 2.8380766103475576e-06, 0.053374592939258975, 4.0648661281862515e-05, -0.009696226742715227, 0.0012104995597298238, 9.113092633299385e-05, -0.0007214783058260106], [-3.583985221056687e-08, -2.8678879904737675e-08, -6.2059617452233685e-06, 1.1919273239449837e-06, 0.00993892254609668, 1.3322105796805922e-05, 4.0648661281862535e-05, 0.021172923644337396, -0.0003980214439481869, -0.007335439428865027, -0.0026223905285547057, -3.1519166196298776e-05], [1.8161859005542995e-05, 7.955400707299238e-06, 0.0035299445229429226, -0.0008491143496741096, -0.0311815284604657, -0.015559577969360236, -0.009696226742715228, -0.0003980214439481868, 0.060175821418783845, 0.011175132656182205, 0.0017087414320911425, 0.016725645755908847], [0.00022493145213673316, 0.00022085816576672922, 0.010202056339338513, -0.0013613690992617161, -0.0505552930960144, -0.013071526652462289, 0.0012104995597298233, -0.007335439428865025, 0.011175132656182207, 0.07692939109997576, 0.005417146653235874, 0.03710820803303734], [2.6952661995429627e-05, 2.606044809788843e-05, 0.0013070241042489326, -0.00018868874369380712, -0.007678300747838688, -0.0018982339993614066, 9.11309263329938e-05, -0.0026223905285547066, 0.001708741432091143, 0.0054171466532358745, 0.05133569254626187, 0.004809307069144657], [0.0021386087722633433, 0.002132499294916143, 0.044288268967065475, -0.0027919779841661884, -0.02361817450406576, -0.03121731608796985, -0.0007214783058260106, -3.1519166196298776e-05, 0.01672564575590885, 0.037108208033037354, 0.004809307069144655, 0.1263253465953414]], [[0.12404337853114977, -0.011496329867745094, 0.05695191389554109, -0.029584607580497323, -0.008428103521931848, 0.00031330552932428205, -0.0001253803581902404, 4.8836508812170584e-08, 0.00018615000019699235, -0.00032799652315538305, -9.3292612847321e-06, -0.0017628002725915124], [-0.011496329867745096, 0.05076942840605719, 0.008371630867757985, 0.010305765332412477, 0.0013755834171452661, -5.966761019136217e-05, 2.1849053980599403e-05, -1.3791255405447067e-08, -1.9650696345048643e-05, 6.597448396153609e-05, 2.946029919858455e-06, 0.0004522188989610144], [0.056951913895541106, 0.008371630867757987, 0.09059568466839053, -0.010283484968083966, -0.004118697173598099, 0.0001147999305777359, -5.180514234174632e-05, -8.712895370216128e-10, 0.00013149678890745202, -0.00010034292403028059, 1.7039090025620548e-06, -0.00023938510191213216], [-0.029584607580497323, 0.010305765332412476, -0.010283484968083966, 0.04482062778222613, 0.0041751740462784865, -7.733297018057227e-05, 3.354885158843471e-05, -9.159166976483124e-09, -4.036261931139123e-05, 9.120435296068759e-05, 3.3916356537654864e-06, 0.0011124052698854277], [-0.008428103521931848, 0.0013755834171452661, -0.004118697173598098, 0.0041751740462784865, 0.08475036008431495, 0.0022577294039910047, 0.00011479503212439234, 0.009362470393799139, -0.003930933833571157, -0.029742216434541523, -0.004579397111820759, -0.0022580933288705736], [0.0003133055293242819, -5.966761019136217e-05, 0.00011479993057773581, -7.733297018057222e-05, 0.0022577294039910047, 0.08006340102303958, 0.0006863953707785805, 1.0991021369053142e-05, -0.010881694901639845, -0.0025230600498996926, -0.0001980861137806822, -0.006837736014892176], [-0.00012538035819024038, 2.184905398059941e-05, -5.180514234174628e-05, 3.354885158843471e-05, 0.00011479503212439212, 0.0006863953707785809, 0.05004288979199189, 2.7195668929778944e-06, -0.0020737026753769746, 7.058540934297419e-05, 1.5853929852174803e-06, -0.001456281135632652], [4.8836508812170584e-08, -1.3791255405447065e-08, -8.712895370215797e-10, -9.159166976483106e-09, 0.009362470393799139, 1.0991021369053144e-05, 2.7195668929778944e-06, 0.021172531516650054, -0.00011482763136701446, -0.007234452010612845, -0.0025929408954094837, -2.7657992686522744e-06], [0.00018615000019699238, -1.965069634504864e-05, 0.00013149678890745205, -4.0362619311391244e-05, -0.003930933833571156, -0.01088169490163985, -0.0020737026753769754, -0.00011482763136701446, 0.05081631904630718, 0.0011324167851181814, 0.00015301905177748863, 0.0013256596841710192], [-0.00032799652315538294, 6.597448396153609e-05, -0.00010034292403028055, 9.120435296068759e-05, -0.029742216434541526, -0.0025230600498996913, 7.058540934297408e-05, -0.007234452010612846, 0.001132416785118181, 0.061286593080813974, 0.0030957684883239816, 0.008088989334009549], [-9.3292612847321e-06, 2.946029919858455e-06, 1.7039090025620523e-06, 3.391635653765482e-06, -0.004579397111820757, -0.00019808611378068226, 1.5853929852175074e-06, -0.0025929408954094837, 0.0001530190517774887, 0.003095768488323981, 0.05099576383753262, 0.0005745349724041271], [-0.0017628002725915129, 0.00045221889896101446, -0.0002393851019121319, 0.0011124052698854275, -0.0022580933288705736, -0.006837736014892174, -0.0014562811356326516, -2.765799268652273e-06, 0.0013256596841710187, 0.008088989334009552, 0.000574534972404127, 0.05028042358152758]], [[0.12393585992765496, -0.011480982614952569, 0.05686814817607099, -0.029565697162307576, -0.013230826692792847, 7.167529219480041e-05, -0.00029618919747865, -4.386059712100912e-06, 0.010459586129126732, 0.0008393912669271499, 0.0012146788670784289, -0.0017487335870287073], [-0.011480982614952567, 0.05076784994678674, 0.008382907465646513, 0.010301508337474107, 0.0019416506821810884, -1.3251171483003184e-05, 3.3233795390116704e-05, 4.800936433197028e-07, -0.0012402954901469508, -9.137513262171333e-05, -0.0001437445041071631, 0.00044815850600184957], [0.056868148176070984, 0.008382907465646508, 0.09053856098030902, -0.010262253735455642, -0.007699762060982485, 2.4084252369587215e-05, -0.0002516008520898887, -3.576213306942099e-06, 0.007571475683246463, 0.0006551655658845166, 0.0008811287694368251, -0.00020272871967388467], [-0.029565697162307558, 0.010301508337474105, -0.010262253735455643, 0.04482176314245748, 0.004835983135474595, -2.123652615954424e-05, 1.727493916563755e-05, 3.312853608290058e-07, -0.0016535424420256793, -0.00011597184746586606, -0.00019131069012511716, 0.0011443016821698067], [-0.013230826692792847, 0.0019416506821810886, -0.007699762060982485, 0.004835983135474597, 0.19503651002132535, 0.00022815048981880446, 0.006576368886011593, 0.010603324730248767, -0.18456869552677918, -0.04808816056930106, -0.027083965605756048, -0.0021786390671804227], [7.167529219480036e-05, -1.3251171483003176e-05, 2.4084252369587185e-05, -2.1236526159544226e-05, 0.0002281504898188045, 0.05010226274905563, 0.00023765734564894274, 1.039773694018897e-06, -0.000373230333514321, -0.00018564621617812686, -4.318016070068288e-05, -0.0015616128488746943], [-0.00029618919747865006, 3.32337953901167e-05, -0.0002516008520898887, 1.727493916563757e-05, 0.006576368886011593, 0.0002376573456489428, 0.050314405326850664, 5.6930752981232655e-05, -0.010219166119989045, -0.0017437784360922388, -0.001175205345717737, -0.008374287082662305], [-4.386059712100912e-06, 4.800936433197028e-07, -3.5762133069420984e-06, 3.3128536082900645e-07, 0.010603324730248767, 1.039773694018897e-06, 5.693075298123265e-05, 0.02117144121373891, -0.003911501806530599, -0.007559342915739194, -0.0029761338995850073, -7.470788844146326e-06], [0.010459586129126733, -0.0012402954901469508, 0.007571475683246464, -0.0016535424420256804, -0.18456869552677913, -0.00037323033351432087, -0.010219166119989041, -0.0039115018065306, 0.2732362181129135, 0.04180458332130872, 0.030115764815727062, 0.0033116779554836022], [0.00083939126692715, -9.137513262171333e-05, 0.0006551655658845165, -0.00011597184746586612, -0.04808816056930106, -0.00018564621617812686, -0.0017437784360922388, -0.007559342915739195, 0.041804583321308715, 0.0643050508033472, 0.00804072271002959, 0.0030696695223027073], [0.0012146788670784289, -0.0001437445041071631, 0.0008811287694368254, -0.0001913106901251174, -0.027083965605756044, -4.318016070068288e-05, -0.0011752053457177373, -0.0029761338995850073, 0.03011576481572708, 0.008040722710029589, 0.0549289888129622, 0.0004740193842512027], [-0.001748733587028706, 0.00044815850600184935, -0.00020272871967388407, 0.001144301682169806, -0.0021786390671804236, -0.001561612848874694, -0.008374287082662302, -7.4707888441463236e-06, 0.0033116779554836035, 0.003069669522302708, 0.0004740193842512027, 0.05299607064641465]]], "weight": [0.394, 0.188, 0.294, 0.124], "allpath": {"1-3": [[7.0745138185787075, 7.51030577075395, 7.944457452602898, 8.375200437137275, 8.800663947181267, 9.219437703483731, 9.631110951577204, 10.036596703014212, 10.438130713941495, 10.839007052624629, 11.243228077429382, 11.655228121362759, 12.079736574745839, 12.52175698164917, 12.986577733202319, 13.479675887017727, 14.006329957034014, 14.570795130068758, 15.17514131467736, 15.818268949141663, 16.495780986839243], [1.9404810694019237, 1.8725261321999163, 1.8024925026986132, 1.7294845775724332, 1.653388577756755, 1.574723580124263, 1.4942061735787493, 1.4124419971803222, 1.3298072742589795, 1.2464311378798532, 1.1622050391867889, 1.0767937554700573, 0.9896458980068393, 0.900014382094696, 0.8069978898443052, 0.7096072796996281, 0.6068456206713465, 0.4977752927587944, 0.38154659088921256, 0.2573862341992951, 0.12457307200807353], [3.141262297071071, 4.206986318692768, 5.251500054477477, 6.268678194348103, 7.260097253479585, 8.2310903059453, 9.187005876024815, 10.132266766433645, 11.070978238463372, 12.007682593883203, 12.947604242153988, 13.896258193331926, 14.858612318766989, 15.838177620844647, 16.83643542797288, 17.852851869018995, 18.885437213678767, 19.93156201600549, 20.988693942499882, 22.0548480219601, 23.12872211625519], [23.648597973519973, 22.66159845899535, 21.677895658704763, 20.695134554743927, 19.71038848304927, 18.720764428264417, 17.724131178153335, 16.719873849472414, 15.709491295592393, 14.69684486307228, 13.687974179540614, 12.690529563933234, 11.712965970848062, 10.763701410702936, 9.850462045020572, 8.979962975011444, 8.157874246729984, 7.388790351706903, 6.675882951549091, 6.020217482767456, 5.420145690791635], [49.908548989316195, 49.56932435069748, 49.22011269693138, 48.86103381877404, 48.492143957803016, 48.113409625396365, 47.72467914386693, 47.325651986099864, 46.91584974935113, 46.494599353943585, 46.06104816105168, 45.614239212773256, 45.15327385493416, 44.67756491680487, 44.18713042823987, 43.68281895238804, 43.16634777091201, 42.64010966636042, 42.1068221958529, 41.56916352505283, 41.02951378906927], [27.917405989842297, 27.691296514926684, 27.46053171851833, 27.2241150295429, 26.98103935641672, 26.730541561334242, 26.47221543473599, 26.205999987741496, 25.93210741983203, 25.6509352456391, 25.362984997124112, 25.068796951762362, 24.76890341152156, 24.463799297244623, 24.153927019711304, 23.83967175461268, 23.521363368475637, 23.19928196868037, 22.873664849701765, 22.54471356598416, 22.212600437773812], [20.94820008383107, 21.051002008741758, 21.163422045005454, 21.286053909858655, 21.419210108076907, 21.562677693360072, 21.715781491470704, 21.877583820919437, 22.04706876119921, 22.223262190762828, 22.40529356008837, 22.592418606860353, 22.78401964873248, 22.979594660757215, 23.178741813985052, 23.3811432759666, 23.586550233554057, 23.794770036474997, 24.00565564116527, 24.219097263980718, 24.435015845698274], [11.916824603432374, 11.745348635389709, 11.591288725016929, 11.45454794681222, 11.335065663216497, 11.2328208983996, 11.14783544377681, 11.080176539239877, 11.029959394559912, 10.997349285797542, 10.98256352953845, 10.985873023609109, 11.007603249618871, 11.048134784671806, 11.107902981639139, 11.187396663160847, 11.287155600766198, 11.407766659427008, 11.549858200943165, 11.714092667512462, 11.90115708479145], [1.5906564275330897, 1.6677083524077676, 1.7478518429618266, 1.8313545861684897, 1.9183601898924385, 2.008782607895781, 2.102332303336852, 2.1986006466935937, 2.297137760342346, 2.3975031350991958, 2.4992912283566757, 2.602140635510272, 2.705733885349257, 2.8097923319863316, 2.9140694098812303, 3.018343240089484, 3.122409906393079, 3.2260776639581508, 3.3291624232302808, 3.4314844971313736, 3.5328664667748635], [10.185508858818054, 10.415871345748203, 10.649328759217727, 10.88598860488948, 11.126048910225704, 11.369592116901758, 11.616467573043343, 11.866264056627074, 12.118334577746655, 12.371845315182558, 12.625832427272371, 12.879256840673884, 13.131050788164773, 13.38015284986788, 13.625530753132955, 13.866193352694317, 14.101194489539184, 14.329631947666744, 14.55064414803001, 14.763406834531802, 14.967131148148605], [17.724415250844594, 17.786029432621856, 17.85527564886118, 17.931583919320556, 18.014173260721996, 18.10204078884728, 18.19412585261569, 18.28944801997835, 18.38716477184484, 18.486575809974255, 18.587105051941133, 18.688277585269596, 18.78969847168998, 18.891035531022716, 18.99200611842464, 19.09236740413012, 19.19190955350049, 19.29045126449979, 19.387837251706117, 19.483937224107816, 19.578646047114646], [10.163907731817185, 10.572523992272007, 11.040958401070618, 11.579357395850812, 12.173844724004299, 12.801784779758945, 13.443153347941312, 14.083547935801505, 14.713533743361571, 15.32736402243303, 15.921960578806582, 16.496207560078044, 17.050427298437253, 17.58593217083619, 18.104617916585237, 18.608616287375852, 19.100036572555666, 19.580806566802853, 20.052600354445204, 20.516827938313078, 20.974661730595958]], "2-4": [[7.0759669371462195, 7.508279118040152, 7.93907199937425, 8.366584086346522, 8.788986795826585, 9.204952951920331, 9.614187108182055, 10.01773116791214, 10.417948327782765, 10.818257489415391, 11.22279339962717, 11.636139381135933, 12.06318200426757, 12.50904807075074, 12.979023717378084, 13.478314605762046, 14.011504728643812, 14.58168680539983, 15.189512164430187, 15.832670060821853, 16.506203577972258], [1.9367771913255678, 1.8681506315649457, 1.797557484998637, 1.7241484406057332, 1.6478626930972975, 1.5692488104569013, 1.4890251964329495, 1.4077807096916057, 1.3258618235646147, 1.2433545129100136, 1.1600937227858925, 1.0756749328478332, 0.9894693428716897, 0.9006548575071345, 0.8082709158271647, 0.7112919532024422, 0.6087047301280223, 0.4995583797297051, 0.3829745340267732, 0.2581304209172228, 0.12424296200716939], [3.2006014719900424, 4.264988082532243, 5.307909721254208, 6.323392567240387, 7.3130894771482, 8.282333380145273, 9.236540854798207, 10.180335911809468, 11.118112410229642, 12.054671199262463, 12.995316348506087, 13.945336009661947, 14.909129573309261, 15.88941076246052, 16.88687372239712, 17.900458479209295, 18.92804108910714, 19.96721185228375, 21.015861923209894, 22.07246881326007, 23.136122271074534], [23.418660074628455, 22.404978179687596, 21.395999027970564, 20.389544096915536, 19.382946193926532, 18.37368436519604, 17.360146135965888, 16.342394608900126, 15.322746860494556, 14.305972616538204, 13.299029511136489, 12.310386951931898, 11.349098641453372, 10.42385901343829, 9.542296394688382, 8.710652042212319, 7.9337660245678245, 7.215082665981405, 6.556418547476195, 5.957544309738115, 5.415927556558226], [32.00940547309093, 31.12025879297813, 30.21114109879025, 29.28387348738481, 28.340266513986776, 27.382089195511327, 26.411041671031168, 25.42873302084346, 24.43667071223622, 23.436276105500802, 22.42894790054567, 21.41619986347004, 20.399885641751577, 19.3824820565421, 18.36733777979618, 17.358753491204507, 16.361793966095938, 15.381843506742424, 14.424027671209027, 13.492665435712894, 12.590876498460021], [2.5542756302752143, 2.459005740279039, 2.363608177914211, 2.2674258197534556, 2.1699635446685672, 2.0709806550433165, 1.9704474261010836, 1.8684564310307479, 1.7651497958722027, 1.6606751764653058, 1.5551622143334027, 1.448714184070351, 1.3414053974985989, 1.2332846813252938, 1.1243805597705845, 1.0147064232749072, 0.9042643301568634, 0.7930512745515466, 0.6810612820664619, 0.5682880842397445, 0.4547263201017411], [8.38015829104419, 8.297043869509036, 8.215633768557993, 8.136490687245152, 8.060028893204622, 7.986497972889681, 7.916028485061891, 7.848686434370075, 7.784511102241173, 7.723535992680608, 7.665798572260062, 7.611344312845444, 7.560227899590153, 7.512513226080899, 7.468273144078453, 7.427589244300888, 7.390552048574031, 7.357261613826909, 7.327828079141946, 7.302372472078404, 7.281027047823498], [11.901648942680332, 11.566100141085958, 11.267274845915471, 11.004958555409974, 10.778859863647895, 10.58864548699268, 10.43397235314541, 10.31451462606518, 10.229984355174222, 10.180144891892503, 10.164816737466978, 10.183876204859617, 10.237247264625394, 10.324887522659186, 10.44677077437942, 10.60286747800576, 10.793126735905714, 11.017462473238867, 11.275745986291719, 11.567805216313147, 11.893430096404616], [22.50816511268065, 23.104416034178335, 23.696129771466765, 24.28484181092795, 24.8720884911285, 25.459416169046676, 26.048420619477017, 26.640794359732645, 27.238369461340678, 27.84315366686745, 28.457358668397468, 29.08341654676901, 29.72397500527515, 30.38185707667501, 31.059967085111218, 31.761127952513696, 32.48784914920605, 33.24205073280208, 34.02479915975981, 34.83612678339318, 35.67499527563363], [12.83961082238265, 13.144902485412224, 13.449913413208419, 13.75408108769583, 14.056776533655432, 14.357177155926289, 14.654305768237842, 14.947133082801383, 15.234666028876418, 15.516000543304918, 15.790342106012332, 16.057002273948093, 16.31537789235744, 16.564918431169033, 16.805086403941143, 17.03531710687572, 17.254985374545587, 17.463387287141977, 17.659742423406907, 17.843217210949415, 18.012964746167857], [19.504399897043943, 19.557088590451738, 19.613566903209815, 19.673629074123458, 19.73700826662417, 19.803382648778097, 19.872399410439, 19.943699800516537, 20.016938103482808, 20.091794910024642, 20.167986575294588, 20.245272251293503, 20.323458875449848, 20.402403586859307, 20.482011995147474, 20.562230693197243, 20.643032344251996, 20.72439387066008, 20.80627096024585, 20.88857522540238, 20.9711614165101], [17.404361368528733, 17.812778196223466, 18.287219703922123, 18.836618855631087, 19.44648351410393, 20.094416287221705, 20.760961082227322, 21.43226950358052, 22.099355926051963, 22.75682516210478, 23.401869211228565, 24.033556338193435, 24.652283834776213, 25.25930744384767, 25.856332262408596, 26.445188950213602, 27.027615723696318, 27.605142226075216, 28.179051478567903, 28.750390969634314, 29.320008456752742]]}, "pathAction": {"1-3": 109.74656451966143, "2-4": 156.75802745251002}, "defaultParams": {"Sys_Dim": 12, "Genes": ["mtROS", "noxROS", "AMPK", "HIF1", "ZEB1", "OCT4", "MDM2", "SNAIL", "MIR145", "MIR200", "MIR34", "P53"], "cycle": 500, "xmax": 50, "Tfinal": 1000, "Diffusion": 0.005, "y_min": [0.0, 0.0], "y_max": [60.0, 60.0], "vari_spec": [4, 11], "stablePoints": [[7.0745138185787075, 1.9404810694019237, 3.141262297071071, 23.648597973519973, 49.908548989316195, 27.917405989842297, 20.94820008383107, 11.916824603432374, 1.5906564275330897, 10.185508858818054, 17.724415250844594, 10.163907731817185], [7.0759669371462195, 1.9367771913255678, 3.2006014719900424, 23.418660074628455, 32.00940547309093, 2.5542756302752143, 8.38015829104419, 11.901648942680332, 22.50816511268065, 12.83961082238265, 19.504399897043943, 17.404361368528733], [16.495780986839243, 0.12457307200807353, 23.12872211625519, 5.420145690791635, 41.02951378906927, 22.212600437773812, 24.435015845698274, 11.90115708479145, 3.5328664667748635, 14.967131148148605, 19.578646047114646, 20.974661730595958], [16.506203577972258, 0.12424296200716939, 23.136122271074534, 5.415927556558226, 12.590876498460021, 0.4547263201017411, 7.281027047823498, 11.893430096404616, 35.67499527563363, 18.012964746167857, 20.9711614165101, 29.320008456752742]], "tmax": 5, "pointInPath": 20}, "ODEModelOdeCode": "from scipy.integrate import odeint\nimport numpy as np\ndef get_force(x,t):\n\tmtROS=x[0]\n\tnoxROS=x[1]\n\tAMPK=x[2]\n\tHIF1=x[3]\n\tZEB1=x[4]\n\tOCT4=x[5]\n\tMDM2=x[6]\n\tSNAIL=x[7]\n\tMIR145=x[8]\n\tMIR200=x[9]\n\tMIR34=x[10]\n\tP53=x[11]\n\tR1=(7*AMPK**4)/(10*(AMPK**4+104976))-mtROS/10+5634282409793945/(549755813888*(AMPK**4+14641))+7203/(2*(HIF1**4+2401))\n\tR2=HIF1**4/(10*(HIF1**4+6561))-noxROS/10+2401/(10*(AMPK**4+2401))\n\tR3=6561/(10*(AMPK**4+6561))-AMPK/10+57122/(HIF1**4+28561)+(mtROS+noxROS)**4/((mtROS+noxROS)**4+130321)\n\tR4=(9*HIF1**4)/(10*(HIF1**4+160000))-HIF1/10+3336584857596723/(68719476736*(AMPK**4+28561))+375/(2*(P53**4+625))+(4*(mtROS+noxROS)**4)/(5*((mtROS+noxROS)**4+83521))\n\tR5=(3*HIF1**4)/(5*(HIF1**4+14641))-ZEB1/10+(3*SNAIL**4)/(2*(SNAIL**4+20736))+(6*ZEB1**4)/(5*(ZEB1**4+130321))+4751869352922317/(137438953472*(MIR200**4+38416))+91125/(MIR145**4+50625)\n\tR6=(19*OCT4**4)/(10*(OCT4**4+28561))-OCT4/10+4802/(5*(MIR145**4+2401))+70875/(2*(P53**4+50625))\n\tR7=(7*P53**4)/(10*(P53**4+14641))-MDM2/10+4751869352922317/(68719476736*(MIR145**4+38416))\n\tR8=1125/(MIR34**4+625)-SNAIL/10+4751869352922317/(68719476736*(SNAIL**4+38416))\n\tR9=(3*P53**4)/(10*(P53**4+14641))-MIR145/10+38912/(5*(OCT4**4+4096))+4278419646001971/(34359738368*(ZEB1**4+65536))\n\tR10=OCT4**4/(10*(OCT4**4+1296))-MIR200/10+(4*P53**4)/(5*(P53**4+83521))+1373887882539827/(34359738368*(SNAIL**4+28561))+48000/(ZEB1**4+160000)\n\tR11=(9*P53**4)/(5*(P53**4+1296))-MIR34/10+5000/(SNAIL**4+10000)+10125/(ZEB1**4+50625)\n\tR12=(2*AMPK**4)/(AMPK**4+1296)-P53/10+(9*HIF1**4)/(10*(HIF1**4+83521))+38416/(MDM2**4+38416)\n\treturn np.array([R1,R2,R3,R4,R5,R6,R7,R8,R9,R10,R11,R12])\n", "ODEModelJacCode": "from sympy import Matrix,symbols\nimport numpy as np\nglobal H\nmtROS,noxROS,AMPK,HIF1,ZEB1,OCT4,MDM2,SNAIL,MIR145,MIR200,MIR34,P53=symbols(\"mtROS noxROS AMPK HIF1 ZEB1 OCT4 MDM2 SNAIL MIR145 MIR200 MIR34 P53\")\nY=Matrix([mtROS,noxROS,AMPK,HIF1,ZEB1,OCT4,MDM2,SNAIL,MIR145,MIR200,MIR34,P53])\nR1=(7*AMPK**4)/(10*(AMPK**4+104976))-mtROS/10+5634282409793945/(549755813888*(AMPK**4+14641))+7203/(2*(HIF1**4+2401))\nR2=HIF1**4/(10*(HIF1**4+6561))-noxROS/10+2401/(10*(AMPK**4+2401))\nR3=6561/(10*(AMPK**4+6561))-AMPK/10+57122/(HIF1**4+28561)+(mtROS+noxROS)**4/((mtROS+noxROS)**4+130321)\nR4=(9*HIF1**4)/(10*(HIF1**4+160000))-HIF1/10+3336584857596723/(68719476736*(AMPK**4+28561))+375/(2*(P53**4+625))+(4*(mtROS+noxROS)**4)/(5*((mtROS+noxROS)**4+83521))\nR5=(3*HIF1**4)/(5*(HIF1**4+14641))-ZEB1/10+(3*SNAIL**4)/(2*(SNAIL**4+20736))+(6*ZEB1**4)/(5*(ZEB1**4+130321))+4751869352922317/(137438953472*(MIR200**4+38416))+91125/(MIR145**4+50625)\nR6=(19*OCT4**4)/(10*(OCT4**4+28561))-OCT4/10+4802/(5*(MIR145**4+2401))+70875/(2*(P53**4+50625))\nR7=(7*P53**4)/(10*(P53**4+14641))-MDM2/10+4751869352922317/(68719476736*(MIR145**4+38416))\nR8=1125/(MIR34**4+625)-SNAIL/10+4751869352922317/(68719476736*(SNAIL**4+38416))\nR9=(3*P53**4)/(10*(P53**4+14641))-MIR145/10+38912/(5*(OCT4**4+4096))+4278419646001971/(34359738368*(ZEB1**4+65536))\nR10=OCT4**4/(10*(OCT4**4+1296))-MIR200/10+(4*P53**4)/(5*(P53**4+83521))+1373887882539827/(34359738368*(SNAIL**4+28561))+48000/(ZEB1**4+160000)\nR11=(9*P53**4)/(5*(P53**4+1296))-MIR34/10+5000/(SNAIL**4+10000)+10125/(ZEB1**4+50625)\nR12=(2*AMPK**4)/(AMPK**4+1296)-P53/10+(9*HIF1**4)/(10*(HIF1**4+83521))+38416/(MDM2**4+38416)\nX=Matrix([R1,R2,R3,R4,R5,R6,R7,R8,R9,R10,R11,R12])\nH=X.jacobian(Y).subs([(mtROS,stable[0]),(noxROS,stable[1]),(AMPK,stable[2]),(HIF1,stable[3]),(ZEB1,stable[4]),(OCT4,stable[5]),(MDM2,stable[6]),(SNAIL,stable[7]),(MIR145,stable[8]),(MIR200,stable[9]),(MIR34,stable[10]),(P53,stable[11])])\nH=np.array(H)\n"}